[{
		"title": "Introduction",
		"body": "Define in your own words: (a) intelligence, (b) artificial intelligence, (c) agent, (d) rationality, (e) logical reasoning.\n Read Turing’s original paper on AI @Turing:1950. In the paper, he discusses several objections to his proposed enterprise and his test for intelligence. Which objections still carry weight? Are his refutations valid? Can you think of new objections arising from developments since he wrote the paper? In the paper, he predicts that, by the year 2000, a computer will have a 30% chance of passing a five-minute Turing Test with an unskilled interrogator. What chance do you think a computer would have today? In another 50 years?\n Every year the Loebner Prize is awarded to the program that comes closest to passing a version of the Turing Test. Research and report on the latest winner of the Loebner prize. What techniques does it use? How does it advance the state of the art in AI?\n Are reflex actions (such as flinching from a hot stove) rational? Are they intelligent?\n There are well-known classes of problems that are intractably difficult for computers, and other classes that are provably undecidable. Does this mean that AI is impossible?\n Suppose we extend Evans’s SYSTEM program so that it can score 200 on a standard IQ test. Would we then have a program more intelligent than a human? Explain.\n The neural structure of the sea slug Aplysia has been widely studied (first by Nobel Laureate Eric Kandel) because it has only about 20,000 neurons, most of them large and easily manipulated. Assuming that the cycle time for an Aplysia neuron is roughly the same as for a human neuron, how does the computational power, in terms of memory updates per second, compare with the high-end computer described in (Figure computer-brain-table)?\n How could introspection—reporting on one’s inner thoughts—be inaccurate? Could I be wrong about what I’m thinking? Discuss.\n To what extent are the following computer systems instances of artificial intelligence: Supermarket bar code scanners. Web search engines. Voice-activated telephone menus. Internet routing algorithms that respond dynamically to the state of the network.\n To what extent are the following computer systems instances of artificial intelligence: Supermarket bar code scanners. Voice-activated telephone menus. Spelling and grammar correction features in Microsoft Word. Internet routing algorithms that respond dynamically to the state of the network.\n Many of the computational models of cognitive activities that have been proposed involve quite complex mathematical operations, such as convolving an image with a Gaussian or finding a minimum of the entropy function. Most humans (and certainly all animals) never learn this kind of mathematics at all, almost no one learns it before college, and almost no one can compute the convolution of a function with a Gaussian in their head. What sense does it make to say that the 'vision system” is doing this kind of mathematics, whereas the actual person has no idea how to do it?\n Some authors have claimed that perception and motor skills are the most important part of intelligence, and that 'higher level” capacities are necessarily parasitic—simple add-ons to these underlying facilities. Certainly, most of evolution and a large part of the brain have been devoted to perception and motor skills, whereas AI has found tasks such as game playing and logical inference to be easier, in many ways, than perceiving and acting in the real world. Do you think that AI’s traditional focus on higher-level cognitive abilities is misplaced?\n Why would evolution tend to result in systems that act rationally? What goals are such systems designed to achieve?\n Is AI a science, or is it engineering? Or neither or both? Explain.\n 'Surely computers cannot be intelligent—they can do only what their programmers tell them.” Is the latter statement true, and does it imply the former?\n 'Surely animals cannot be intelligent—they can do only what their genes tell them.” Is the latter statement true, and does it imply the former?\n 'Surely animals, humans, and computers cannot be intelligent—they can do only what their constituent atoms are told to do by the laws of physics.” Is the latter statement true, and does it imply the former?\n Examine the AI literature to discover whether the following tasks can currently be solved by computers: Playing a decent game of table tennis (Ping-Pong). Driving in the center of Cairo, Egypt. Driving in Victorville, California. Buying a week’s worth of groceries at the market. Buying a week’s worth of groceries on the Web. Playing a decent game of bridge at a competitive level. Discovering and proving new mathematical theorems. Writing an intentionally funny story. Giving competent legal advice in a specialized area of law. Translating spoken English into spoken Swedish in real time. Performing a complex surgical operation.\n For the currently infeasible tasks, try to find out what the difficulties are and predict when, if ever, they will be overcome.\n Various subfields of AI have held contests by defining a standard task and inviting researchers to do their best. Examples include the DARPA Grand Challenge for robotic cars, the International Planning Competition, the Robocup robotic soccer league, the TREC information retrieval event, and contests in machine translation and speech recognition. Investigate five of these contests and describe the progress made over the years. To what degree have the contests advanced the state of the art in AI? To what degree do they hurt the field by drawing energy away from new ideas?\n",
		"author": "Peter Norvig",
		"id": "1"
	},
	{
		"title": "Intelligent Agents",
		"body": "Suppose that the performance measure is concerned with just the first T time steps of the environment and ignores everything thereafter. Show that a rational agent’s action may depend not just on the state of the environment but also on the time step it has reached.\n Let us examine the rationality of various vacuum-cleaner agent functions. Show that the simple vacuum-cleaner agent function described in Figure vacuum-agent-function-table is indeed rational under the assumptions listed on page vacuum-rationality-page. Describe a rational agent function for the case in which each movement costs one point. Does the corresponding agent program require internal state? Discuss possible agent designs for the cases in which clean squares can become dirty and the geography of the environment is unknown. Does it make sense for the agent to learn from its experience in these cases? If so, what should it learn? If not, why not?\n Write an essay on the relationship between evolution and one or more of autonomy, intelligence, and learning.\n For each of the following assertions, say whether it is true or false and support your answer with examples or counterexamples where appropriate. An agent that senses only partial information about the state cannot be perfectly rational. There exist task environments in which no pure reflex agent can behave rationally. There exists a task environment in which every agent is rational. The input to an agent program is the same as the input to the agent function. Every agent function is implementable by some program/machine combination. Suppose an agent selects its action uniformly at random from the set of possible actions. There exists a deterministic task environment in which this agent is rational. It is possible for a given agent to be perfectly rational in two distinct task environments. Every agent is rational in an unobservable environment. A perfectly rational poker-playing agent never loses.\n For each of the following activities, give a PEAS description of the task environment and characterize it in terms of the properties listed in Section env-properties-subsection. Playing soccer. Exploring the subsurface oceans of Titan. Shopping for used AI books on the Internet. Playing a tennis match. Practicing tennis against a wall. Performing a high jump. Knitting a sweater. Bidding on an item at an auction.\n For each of the following activities, give a PEAS description of the task environment and characterize it in terms of the properties listed in Section env-properties-subsection. Performing a gymnastics floor routine. Exploring the subsurface oceans of Titan. Playing soccer. Shopping for used AI books on the Internet. Practicing tennis against a wall. Performing a high jump. Bidding on an item at an auction.\n Define in your own words the following terms: agent, agent function, agent program, rationality, autonomy, reflex agent, model-based agent, goal-based agent, utility-based agent, learning agent.\n This exercise explores the differences between agent functions and agent programs. Can there be more than one agent program that implements a given agent function? Give an example, or show why one is not possible. Are there agent functions that cannot be implemented by any agent program? Given a fixed machine architecture, does each agent program implement exactly one agent function? Given an architecture with n bits of storage, how many different possible agent programs are there? Suppose we keep the agent program fixed but speed up the machine by a factor of two. Does that change the agent function?\n Write pseudocode agent programs for the goal-based and utility-based agents.\n Consider a simple thermostat that turns on a furnace when the temperature is at least 3 degrees below the setting, and turns off a furnace when the temperature is at least 3 degrees above the setting. Is a thermostat an instance of a simple reflex agent, a model-based reflex agent, or a goal-based agent?\n The following exercises all concern the implementation of environments and agents for the vacuum-cleaner world.\n Implement a performance-measuring environment simulator for the vacuum-cleaner world depicted in Figure vacuum-world-figure and specified on page vacuum-rationality-page. Your implementation should be modular so that the sensors, actuators, and environment characteristics (size, shape, dirt placement, etc.) can be changed easily. (Note: for some choices of programming language and operating system there are already implementations in the online code repository.)\n Implement a simple reflex agent for the vacuum environment in Exercise vacuum-start-exercise. Run the environment with this agent for all possible initial dirt configurations and agent locations. Record the performance score for each configuration and the overall average score.\n Consider a modified version of the vacuum environment in Exercise vacuum-start-exercise, in which the agent is penalized one point for each movement. Can a simple reflex agent be perfectly rational for this environment? Explain. What about a reflex agent with state? Design such an agent. How do your answers to 1 and 2 change if the agent’s percepts give it the clean/dirty status of every square in the environment?\n Consider a modified version of the vacuum environment in Exercise vacuum-start-exercise, in which the geography of the environment—its extent, boundaries, and obstacles—is unknown, as is the initial dirt configuration. (The agent can go Up and Down as well as Left and Right.) Can a simple reflex agent be perfectly rational for this environment? Explain. Can a simple reflex agent with a randomized agent function outperform a simple reflex agent? Design such an agent and measure its performance on several environments. Can you design an environment in which your randomized agent will perform poorly? Show your results. Can a reflex agent with state outperform a simple reflex agent? Design such an agent and measure its performance on several environments. Can you design a rational agent of this type?\n Repeat Exercise vacuum-unknown-geog-exercise for the case in which the location sensor is replaced with a 'bump” sensor that detects the agent’s attempts to move into an obstacle or to cross the boundaries of the environment. Suppose the bump sensor stops working; how should the agent behave?\n The vacuum environments in the preceding exercises have all been deterministic. Discuss possible agent programs for each of the following stochastic versions: Murphy’s law: twenty-five percent of the time, the Suck action fails to clean the floor if it is dirty and deposits dirt onto the floor if the floor is clean. How is your agent program affected if the dirt sensor gives the wrong answer 10% of the time? Small children: At each time step, each clean square has a 10% chance of becoming dirty. Can you come up with a rational agent design for this case?\n",
		"author": "Peter Norvig",
		"id": "2"
	}
]